# HW6 Report

**R12921059 電機所碩一 鄧雅文**

## MongoDB 

### Task1

```
mongoimport -d hw6 -c students path_to_file\studentE.csv --type csv --headerline
```

Result:

![image-20240525120954515](C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525120954515.png)


### Task2

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525134223024.png" alt="image-20240525134223024" style="zoom:80%;" />

Result:

```json
[
  {
    "_id": "資工所",
    "count": 14
  },
  {
    "_id": "電機所",
    "count": 11
  },
  {
    "_id": "生物機電所",
    "count": 8
  },
  {
    "_id": "經濟系",
    "count": 6
  },
  {
    "_id": "電機系",
    "count": 6
  },
  {
    "_id": "資訊管理所",
    "count": 5
  },
  {
    "_id": "電信所",
    "count": 5
  },
  {
    "_id": "資工系",
    "count": 4
  },
  {
    "_id": "生物機電系",
    "count": 4
  },
  {
    "_id": "工科海洋所",
    "count": 3
  }
]
```

### Task3

```
mongoimport -d hw6 -c students path_to_file\new_studentE.csv --type csv --headerline
```

Result:

![image-20240525124626226](C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525124626226.png)

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525134359717.png" alt="image-20240525134359717" style="zoom:80%;" />

Result

```json
[
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  },
  {
    "position": "旁聽生",
    "dept": "電機所",
    "updated": {
      "$date": "2024-05-23T00:00:00Z"
    }
  }
]
```

### Task4

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525134513819.png" alt="image-20240525134513819" style="zoom:70%;" />

Result:

```json
[
  {
    "position": "學生",
    "dept": "電機所",
    "name": "鄧雅文 (TENG, YA-WEN)",
    "email": "r12921059@ntu.edu.tw",
    "updated": {
      "$date": "2024-06-01T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "太空系",
    "name": "劉海王 (LIU, NEPTUNE)",
    "email": "b19303008@ntu.edu.tw",
    "updated": {
      "$date": "2024-06-01T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "太空所",
    "name": "吳火箭 (WU, ROCKET)",
    "email": "r19303129@ntu.edu.tw",
    "updated": {
      "$date": "2024-06-01T00:00:00Z"
    }
  },
  {
    "position": "學生",
    "dept": "太空所",
    "name": "黃人馬 (HUANG, CENTAURUS)",
    "email": "r09303019@ntu.edu.tw",
    "updated": {
      "$date": "2024-06-01T00:00:00Z"
    }
  }
]
```

### Task5

#### 5-1

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525134636597.png" alt="image-20240525134636597" style="zoom:80%;" />

Result:

```
{ _id: '政治所', count: 3 }
{ _id: '醫工系', count: 2 }
{ _id: '基因學位學程', count: 1 }
{ _id: '動科系', count: 2 }
{ _id: '網媒所', count: 3 }
{ _id: '工管系科管組', count: 1 }
{ _id: '生物機電所', count: 8 }
{ _id: '資工所', count: 15 }
{ _id: '機械所固力組', count: 2 }
{ _id: '電信所', count: 6 }
{ _id: '工科海洋所', count: 3 }
{ _id: '經濟系', count: 6 }
{ _id: '電機系', count: 8 }
{ _id: '生醫電資所', count: 1 }
{ _id: '資工系', count: 5 }
{ _id: '', count: 2 }
{ _id: '土木所水利組', count: 1 }
{ _id: '土木所營管組', count: 2 }
{ _id: '材料所應材班', count: 1 }
{ _id: '土木所CAE組', count: 1 }
{ _id: '生物機電系', count: 4 }
{ _id: '機械系', count: 1 }
{ _id: '森林環資所', count: 1 }
{ _id: '材料所', count: 1 }
{ _id: '機械所製造組', count: 2 }
{ _id: '財金系', count: 1 }
{ _id: '流預所', count: 1 }
{ _id: '工管系企管組', count: 1 }
{ _id: '資訊管理所', count: 5 }
{ _id: '材料系', count: 1 }
{ _id: '電機所', count: 11 }
```

#### 5-2

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525134711794.png" alt="image-20240525134711794" style="zoom:80%;" />

Result:

```
 _id: '政治所', count: 3 }
{ _id: '醫工系', count: 2 }
{ _id: '基因學位學程', count: 1 }
{ _id: '動科系', count: 2 }
{ _id: '網媒所', count: 3 }
{ _id: '工管系科管組', count: 1 }
{ _id: '生物機電所', count: 8 }
{ _id: '資工所', count: 15 }
{ _id: '機械所固力組', count: 2 }
{ _id: '電信所', count: 6 }
{ _id: '工科海洋所', count: 3 }
{ _id: '經濟系', count: 6 }
{ _id: '電機系', count: 8 }
{ _id: '生醫電資所', count: 1 }
{ _id: '資工系', count: 5 }
{ _id: '', count: 2 }
{ _id: '土木所水利組', count: 1 }
{ _id: '土木所營管組', count: 2 }
{ _id: '材料所應材班', count: 1 }
{ _id: '土木所CAE組', count: 1 }
{ _id: '生物機電系', count: 4 }
{ _id: '機械系', count: 1 }
{ _id: '森林環資所', count: 1 }
{ _id: '材料所', count: 1 }
{ _id: '機械所製造組', count: 2 }
{ _id: '財金系', count: 1 }
{ _id: '流預所', count: 1 }
{ _id: '工管系企管組', count: 1 }
{ _id: '資訊管理所', count: 5 }
{ _id: '材料系', count: 1 }
{ _id: '電機所', count: 1 }
{ _id: '太空系', count: 1 }
{ _id: '太空所', count: 2 }
```

### Task6

```
mongoimport -d hw6 -c student_groups path_to_file\student_groupE.csv --type csv --headerline
```

Result:

![image-20240525132947308](C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525132947308.png)

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525134806930.png" alt="image-20240525134806930" style="zoom:80%;" />

隨便點入某個students document查看，成功加入group:

```json
{
  "_id": "b10303008",
  "position": "學生",
  "dept": "經濟系",
  "year": 3,
  "name": "劉家妮 (CHIA-NIH LIU)",
  "email": "b10303008@ntu.edu.tw",
  "class": "資料庫系統-從SQL到NoSQL (EE5178)",
  "updated": {
    "$date": "2024-05-23T00:00:00Z"
  },
  "group": 12
}
```

### Task7

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525134838803.png" alt="image-20240525134838803" style="zoom:80%;" />

Result:

```json
[
  {
    "members": [
      "廖宥弘 (YOU-HONG LIAO)",
      "許景淯 (HSU CHING YU)",
      "劉庭均 (Liu,ting-chun)",
      "吳承羲 (WU,CHENG-XI)"
    ],
    "group": 20
  },
  {
    "members": [
      "黃于軒 (HUANG,YU-hsUAN)",
      "侯貝霖 (PEI-LIN HOU)",
      "包杰修 (PAO, CHIEH-HSIU)",
      "劉瑄穎 (LIU,HSUAN-YING)"
    ],
    "group": 17
  },
  {
    "members": [
      "楊沛蓉 (PEI-RONG YANG)",
      "周昱宏 (CHOU, YU-HONG)",
      "林佳儀 (LIN, CHIA-YI)",
      "陳怜均 (CHEN, LING-CHUN)"
    ],
    "group": 8
  },
  {
    "members": [
      "林睿霖 (LIN,RUEI-LIN)",
      "李胤愷 (Lee, yin-kai)",
      "林翰莘 (LIN, HAN-HSIN)",
      "林峻佑 (LIN, CHUN-YU)"
    ],
    "group": 5
  },
  {
    "members": [
      "許致銓 (CHIH-CHUAN HSU)",
      "陳冠霖 (CHEN,GUAN-LIN)",
      "吳建翰 (WU, JIAN-HAN)",
      "林郁敏 (LIN, YU-MIN)"
    ],
    "group": 9
  },
  {
    "members": [
      "曾光良 (TSENG, KUANG-LIANG)",
      "陳映璇 (YING-HSUAN CHEN)",
      "郭承諺 (CHENG-YEN KUO)",
      "卓均而 (CHO, CHUN-ERH)"
    ],
    "group": 6
  },
  {
    "members": [
      "白騏瑞 (BAI, CI-RUEI)",
      "陳思齊 (CHEN, SSU-CHI)",
      "蔡知芸 (TSAI, CHIH-YUN)",
      "葉政翔 (ZHENG-XIANG YE)"
    ],
    "group": 14
  },
  {
    "members": [
      "黃  靖 (HUANG, JING)",
      "柯岱佑 (KO, DAI-YOU)",
      "楊士聖 (YANG, SHIH-SHENG)",
      "陳祈安 (CHEN, CHI-AN)"
    ],
    "group": 21
  },
  {
    "members": [
      "呂彥欣 (LU,YAN-XIN)",
      "李英碩 (LEE YING-SHUO)",
      "高子維 (KAO, TZU-WEI)",
      "郭沛孚 (GUO, PEI-FU)"
    ],
    "group": 13
  },
  {
    "members": [
      "吳柏賢 (WU PO-HSIEN)",
      "彭昱齊 (PENG YUCHI)",
      "楊冠柏 (YANG, GUAN-BO)"
    ],
    "group": 22
  },
  {
    "members": [
      "李語婕 (LEE, YU-CHIEH)",
      "陳沛妤 (PEI-YU CHEN)",
      "游景恩 (YU, JING-EN)",
      "張心瑜 (CHANG, HSIN-YU)"
    ],
    "group": 4
  },
  {
    "members": [
      "晏文芳 (YEN, WEN-FANG)",
      "張乃恩 (ZHANG,NAI-EN)",
      "洪旭初 (HONG, XU-CHU)",
      "陳冠甫 (GUAN-FU,CHEN)"
    ],
    "group": 18
  },
  {
    "members": [
      "鄭淳哲 (CHENG CHUN-TSE)",
      "薛  龍 (HSUEH, LUNG)",
      "曹宸睿 (Chen Jui Tsao)",
      "毛翊蓁 (MAO YI CHEN)"
    ],
    "group": 15
  },
  {
    "members": [
      "李哲維 (LEE, ZER-WEI)",
      "費俊昱 (CHUN-YU FEI)",
      "沈信宏 (SHEN, XIN-HONG)"
    ],
    "group": 23
  },
  {
    "members": [
      "賴宇辰 (LAI,YU/CHEN)",
      "王奕翔 (Wang Yi-Hsiang)",
      "許國昌 (KUO-CHANG HSU)"
    ],
    "group": 24
  },
  {
    "members": [
      "劉姝豆 (SHU-DOU,LIU)",
      "李宇軒 (LEE, YU-HSUAN)",
      "鍾靖詮 (CHUNG, CHING-CHUAN)",
      "黃冠綸 (HUANG, GUAN-LUN)"
    ],
    "group": 2
  },
  {
    "members": [
      "賴翰霖 (HAN-LIN LAI)",
      "江浩辰 (JIANG, HAO-CHEN)",
      "丁柏豪 (PO-HAO TING)",
      "陳乙馨 (CHEN, I-HSIN)"
    ],
    "group": 3
  },
  {
    "members": [
      "張瀚文 (CHANG HAN-WEN)",
      "張容誠 (JUNG-CHENG CHANG)",
      "謝廷寬",
      "黃柏儒 (HUANG,BO-RU)"
    ],
    "group": 16
  },
  {
    "members": [
      "許喬淇 (HSU, CHIAO-CHI)",
      "謝欣妤 (HSIEH, HSIN-YU)",
      "連震宇 (LIAN, JEN-YU)",
      "鄭朝鴻 (CHAO HUNG, JENG)"
    ],
    "group": 1
  },
  {
    "members": [
      "周哲瑋 (CHOU,CHE-WEI)",
      "王偉力 (WANG, WEI-LI)",
      "吳吉加 (CHI-CHIA WU)",
      "鄧雅文 (TENG, YA-WEN)"
    ],
    "group": 7
  }
]
```



## Neo4j

### Task1

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525143329928.png" alt="image-20240525143329928" style="zoom:80%;" />

執行下圖即可列印student，並確認達成task1:

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525143538934.png" alt="image-20240525143538934" style="zoom:80%;" />

### Task2

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525183743710.png" alt="image-20240525183743710" style="zoom:80%;" />

執行兩個下圖即可確認達成task2:

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525185006251.png" alt="image-20240525185006251" style="zoom:80%;" />

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525183809176.png" alt="image-20240525183809176" style="zoom:80%;" />

### Task3

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525145906854.png" alt="image-20240525145906854" style="zoom:80%;" />

### Task4

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525150351486.png" alt="image-20240525150351486" style="zoom:80%;" />

執行兩個下圖即可確認達成task4:

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525150510814.png" alt="image-20240525150510814" style="zoom:80%;" />

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525150604554.png" alt="image-20240525150604554" style="zoom:80%;" />

### Task5

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525181520440.png" alt="image-20240525181520440" style="zoom:80%;" />

### Task6

(code 比較長沒辦法直接截，所以用打的)

```cypher
MATCH (s:Student)-[:BELONGS_TO]->(g:Group)
MATCH (s)-[:BELONGS_TO_DEPT]->(d:Department)
WITH g, COUNT(DISTINCT d.name) AS deptCount
ORDER BY deptCount DESC
LIMIT 5

WITH collect(g) AS topGroups

MATCH (s:Student)-[:BELONGS_TO]->(g)
MATCH (s)-[:BELONGS_TO_DEPT]->(d:Department)
WHERE g IN topGroups 
WITH g, collect(DISTINCT d.name) AS departments

ORDER BY g.group ASC
RETURN g.group AS groupNumber, departments;
```

Result:

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525184127032.png" alt="image-20240525184127032" style="zoom:80%;" />

### Task7

(code 比較長沒辦法直接截，所以用打的)

```cypher
WITH 'r12921059' AS my_id
MATCH (me:Student {_id: my_id})-[:BELONGS_TO]->(g:Group)<-[:BELONGS_TO]-(partner:Student)

MATCH (partner)-[:BELONGS_TO_DEPT]->(d:Department)

MATCH (s:Student)-[:BELONGS_TO_DEPT]->(d)
WITH partner.name AS partnerName, d.name AS deptName, COUNT(s) AS deptSize

RETURN partnerName, deptName, deptSize
ORDER BY deptSize ASC;
```

Result:

<img src="C:\Users\betty\AppData\Roaming\Typora\typora-user-images\image-20240525184819681.png" alt="image-20240525184819681" style="zoom:80%;" />
